Revit 2026 API

# PipeSettingsSetPipeSlopes Method

---
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetPipeSlopes(
	IList<double> slopes
)
```
```vb
Public Sub SetPipeSlopes (
	slopes As IList(Of Double)
)
```
```cpp
public:
void SetPipeSlopes(
	IList<double>^ slopes
)
```
```fsharp
member SetPipeSlopes :
        slopes : IList<float> -> unit
```

#### Parameters

slopes IListDouble

#### Reference

PipeSettings Class

Autodesk.Revit.DB.Plumbing Namespace